#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sophiekruijt/home-automation/runs/run-CE2Q1ZfoJmLSUAFh

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
google_sql_database_instance.master: Refreshing state... [id=home-automation-db]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_sql_database_instance.master has been deleted
  - resource "google_sql_database_instance" "master" {
      - connection_name               = "homeautomation-316520:us-central1:home-automation-db" -> null
      - database_version              = "MYSQL_8_0" -> null
      - deletion_protection           = true -> null
      - first_ip_address              = "35.192.111.18" -> null
      - id                            = "home-automation-db" -> null
      - ip_address                    = [
          - {
              - ip_address     = "35.192.111.18"
              - time_to_retire = ""
              - type           = "PRIMARY"
            },
        ] -> null
      - name                          = "home-automation-db" -> null
      - project                       = "homeautomation-316520" -> null
      - public_ip_address             = "35.192.111.18" -> null
      - region                        = "us-central1" -> null
      - self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/homeautomation-316520/instances/home-automation-db" -> null
      - server_ca_cert                = [
          - {
              - cert             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ0Nzgw
                    ZWI2YS03YzNiLTRhMDAtYmQ4NS1mODdkZGQwMGMxODkxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjEwNjExMjEwODA1WhcNMzEwNjA5MjEwOTA1WjB3MS0wKwYD
                    VQQuEyQ0NzgwZWI2YS03YzNiLTRhMDAtYmQ4NS1mODdkZGQwMGMxODkxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCXq7DfuNhku40ud5f9TRxQsD1K3D4TIbEN5DzIkfMf9S40eV/wVwpkluJ7erS7
                    Uas96rJWPaGNflw1uIwBSqKGPWXHKina9AK0uyv0wBa/wt4VrlthNNKDrR/Pfv8s
                    m6px2A3vdFBwBt2frzAI5tamfqcaEuf14ILtSPZg9BFgUhy0u4j7R15CUBBcjvsn
                    6JbtQiUYoOyO8rEP73xDAeUdSoi2A7fU41tzTx2b40g4PfwP1llgPHaCNuf9jSUg
                    +E3HRif2Lz/1Ybc4VMxQdSMEZYT6tJF6Q0kp2QHY1tT5aCmsyTkK/eGhk0UUgBU7
                    QHjGYjOn4f4Xros9L1yZJnsNAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBACcQupTVOpnATn/CCFMU7XENyKJdPEkEX5L7Y9Ko
                    11MDp0R3+6SZvv/kkcnbJR3PnEpa7IpEmLRwwOQadgicEE9uFP2lg87FBNi6GpQD
                    c4iHXDEiZKkqmaINhVDTTuQFLMQh+uiQ7UOKTrsqnaTq4V+6jLtmg6FW0TO1cWr5
                    iUvr3FlLWpn0KWlEnYaCF/eyP1ssbuN+v0S6gsmY4MoiK01045OPMnKfKZWEtI+f
                    gjM/wKJm91z7XoKGhLbRgn+85pc8yjR0uQnJrkNuEjaOJKhZlaEi9QuiCCJul/qb
                    WEfulAIqNGN5ndwKAPuClaqpwd1vANUFdzQ6M5LgLBivTTo=
                    -----END CERTIFICATE-----
                EOT
              - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=4780eb6a-7c3b-4a00-bd85-f87ddd00c189"
              - create_time      = "2021-06-11T21:08:05.192Z"
              - expiration_time  = "2031-06-09T21:09:05.192Z"
              - sha1_fingerprint = "08baa7a7a3165cc6fbca0d148069060277a9ee6d"
            },
        ] -> null
      - service_account_email_address = "p349431539442-jdxsv5@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null

      - settings {
          - activation_policy           = "ALWAYS" -> null
          - authorized_gae_applications = [] -> null
          - availability_type           = "ZONAL" -> null
          - crash_safe_replication      = false -> null
          - disk_autoresize             = true -> null
          - disk_autoresize_limit       = 0 -> null
          - disk_size                   = 10 -> null
          - disk_type                   = "PD_SSD" -> null
          - pricing_plan                = "PER_USE" -> null
          - replication_type            = "SYNCHRONOUS" -> null
          - tier                        = "db-f1-micro" -> null
          - user_labels                 = {} -> null
          - version                     = 1 -> null

          - backup_configuration {
              - binary_log_enabled             = false -> null
              - enabled                        = false -> null
              - point_in_time_recovery_enabled = false -> null
              - start_time                     = "19:00" -> null
              - transaction_log_retention_days = 7 -> null

              - backup_retention_settings {
                  - retained_backups = 7 -> null
                  - retention_unit   = "COUNT" -> null
                }
            }

          - ip_configuration {
              - ipv4_enabled = true -> null
              - require_ssl  = false -> null
            }

          - location_preference {
              - zone = "us-central1-f" -> null
            }
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database_instance.home-automation-mysql will be created
  + resource "google_sql_database_instance" "home-automation-mysql" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_8_0"
      + deletion_protection           = true
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "home-automation-mysql"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = (known after apply)
          + authorized_gae_applications = (known after apply)
          + availability_type           = (known after apply)
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = (known after apply)
          + disk_type                   = (known after apply)
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = (known after apply)
              + enabled                        = (known after apply)
              + location                       = (known after apply)
              + point_in_time_recovery_enabled = (known after apply)
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = (known after apply)
              + private_network = (known after apply)
              + require_ssl     = (known after apply)

              + authorized_networks {
                  + expiration_time = (known after apply)
                  + name            = (known after apply)
                  + value           = (known after apply)
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mysql_database_public_ip = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation errored.


------------------------------------------------------------------------
```
</details>
*Pusher: @sophiekruijt, Action: `pull_request`*